{"id":49261,"title":"On the Floor","releaseDate":"2011-02-08","primaryArtistId":2487,"primaryArtistName":"Jennifer Lopez","featuredArtistIds":[628],"featuredArtistNames":["Pitbull"],"coverThumbnailUrl":"https:\/\/images.genius.com\/b68c1f9c9915a46926ccf13df27ad0f7.300x300x1.jpg","coverImageUrl":"https:\/\/images.genius.com\/b68c1f9c9915a46926ccf13df27ad0f7.1000x1000x1.jpg","spotifyUrl":"https:\/\/open.spotify.com\/track\/0Oe49j06Bjrxs8PltuVeaW","youtubeUrl":"http:\/\/www.youtube.com\/watch?v=t4H_Zoh7G5A","lyricsUrl":"https:\/\/genius.com\/Jennifer-lopez-on-the-floor-lyrics","lyrics":"[Intro: Mike Shinoda & Jay-Z]\nYeah\nThank you, thank you, thank you, you're far too kind! \nAh, uh, whoo, yeah! Ready?\nWhoo, whoo, whoo!\nLet's go!\n\n[Chorus: Jay-Z & Chester Bennington ]\n\nCookin' raw with the Brooklyn boy\nSo for one last time I need y'all to roar\nUh, uh, uh, uh \nNow, what the hell are you waiting for?\nAfter me, there shall be no more\nSo for one last time, nigga, make some noise\n\n[Post-Chorus: Mike Shinoda]\nGet 'em Jay!\n\n[Verse 1: Jay-Z]\nWho you know fresher than Hov'? Riddle me that!\nThe rest of y'all know where I'm lyrically at\nCan't none of y'all mirror me back, yeah, hearin' me rap\nIs like hearin' G. Rap in his prime, I'm\nYoung H.O., rap's grateful dead\n'Bout to take over the globe, now break bread\nI'm in Boeing jets, Global Express\nOut the country but the blueberry still connect\nOn the low but the yacht got a triple deck\nBut when you young, what the fuck you expect? Yep, yep!\nGrand openin', grand closin'\nGod damn, your man Hov' cracked the can open again\nWho you gon' find doper than him\nWith no pen, just draw off inspira-tion-tion\nSoon you gon' see you can't replace him-him\nWith cheap imitations for these generations\n\n[Chorus: Jay-Z & Chester Bennington ]\nEncore, do you want more?\nCookin' raw with the Brooklyn boy\nSo for one last time I need y'all to roar\nUh, uh, uh, uh \nNow, what the hell are you waiting for?\nAfter me, there shall be no more\nSo for one last time, nigga, make some noise\nWhat the hell are you waiting for?\n\n[Verse 2: Jay-Z & Mike Shinoda]\nLook what you made me do, look what I made for you\nKnew if I paid my dues, how will they pay you?\nWhen you first come in the game, they try to play you\nThen you drop a couple of hits, look how they wave to you \nFrom Marcy to Madison Square\nTo the only thing that matters in just a matter of years \nAs fate would have it, Jay's status appears\nTo be at an all-time high, perfect time to say goodbye\nWhen I come back like Jordan\nWearin' the 45, it ain't to play games with you\nIt's to aim at you, probably maim you\nIf I owe you I'm blowin' you to smithereens\nCocksucker, take one for your team\nAnd I need you to remember one thing \nI came, I saw, I conquered\nFrom record sales, to sold-out concerts\nSo, motherfucker, if you want this encore\nI need you to scream, 'til your lungs get sore \n\n[Verse 3: Chester Bennington & Mike Shinoda]\nI'm tired of being what you want me to be\nFeeling so faithless, lost under the surface\nDon't know what you're expecting of me\nPut under the pressure of walking in your shoes\n\nEvery step that I take is another mistake to you\n\nAnd every second I waste is more than I can take!\n\n[Chorus 2: Chester Bennington]\nI've become so numb, I can't feel you there\nBecome so tired, so much more aware\nI'm becoming this, all I want to do\nIs be more like me and be less like you\nI've become so numb\n\n[Outro: Jay-Z & Chester Bennington]\nCan I get a encore? Do you want more? \nI've become so numb\nSo for one last time I need y'all to roar\nOne last time I need y'all to roar"}